Revit 2024 API
BuiltInFailures.CopyMonitorFailures.CannotMoveHostedFixtureViaCopyMonitor Property
 The fixture is hosted and cannot be moved. Use the Move command to relocate the fixture in the host file as required.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotMoveHostedFixtureViaCopyMonitor { get; }
Visual Basic
Public Shared ReadOnly Property CannotMoveHostedFixtureViaCopyMonitor As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotMoveHostedFixtureViaCopyMonitor {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CopyMonitorFailures Class
Autodesk.Revit.DB Namespace